Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །དགའ་བ་བཞི་ཡི་རང་བཞིན་ནོ།
en: And is purified of the four Māras.

source: །སྔར་གསུངས་དཀྱིལ་འཁོར་འཁོར་ལོར་གནས།
en: “Standing in the previously described maṇḍala circle,

source: །ཧཱུྃ་གི་ས་བོན་ལས་བྱུང་བའི།
en: He has transformed from the seed syllable hūṁ

source: །གཡོན་ན་ཐོད་པ་ལྷ་དང་ནི།
en: In his left hand there is a skull cup

source: །ལྷ་མིན་ཁྲག་གིས་བཀང་བ་དང་། །གཡས་ན་རྡོ་རྗེ་མེ་ལྟ་བུས།
en: Filled with the blood of gods and demigods. “In his right hand he holds a flame-like vajra scepter,

source: །འཇིགས་པ་ཡང་ནི་འཇིགས་པར་མཛད།
en: Frightening even fear itself.

source: །གཞན་པ་ཡི་ནི་ཕྱག་དག་གིས།
en: With his other two arms he is embracing the consort , Who, for her part, is embracing him.

source: །ལུས་ལ་ཡང་དག་འཁྱུད་པ་ཉིད།
en: “He should visualize her form

source: །ཤེས་རབ་རྡོ་རྗེ་ཕག་མོ་ནི། །བཅོམ་ལྡན་འདས་ཀྱི་གཟུགས་བརྙན་བསྒོམ།
en: As the Blessed Vajravārāhī.

source: །དང་པོར་སྟོང་པ་བསྒོམ་བྱ་ཞིང་།
en: “First, he should meditate on emptiness.

source: །གཉིས་པ་ལ་ནི་ཆ་བྲལ་ཉིད།
en: Then, on the pericarp of a lotus He should visualize a full moon disk,

source: །ཟླ་བའི་དཀྱིལ་འཁོར་དབུས་གནས་པར། །ཧཱུྃ་ནི་དེར་ནི་བསྒོམ་པར་བྱ།
en: And in the center of this moon disk, the syllable hūṁ . “He should visualize the form of the deity

source: །དེ་བཞིན་ཞལ་གསུམ་ཕྱག་དྲུག་པར། །ལྷ་ཡི་གཟུགས་སུ་བསྒོམ་པར་བྱ།
en: With three faces and six arms.

source: །དང་པོའི་ཞལ་ནི་དཀར་མིན་ཞིང་།
en: The first face is black,

source: །གཡས་པ་དཀར་ཞིང་ཞི་བ་ཉིད།
en: The right one is white and peaceful,

source: །གཡོན་པ་དམར་པོ་ལྟ་བུ་སྟེ།
en: “And the left one is red in color.

source: །སྤྱན་གསུམ་བཟང་པོའི་གཟུགས་ཅན་ཉིད།
en: The lord has three eyes that are sublime in appearance.

source: །རྒྱན་རྣམས་ཀུན་གྱིས་ཡང་དག་གང་།
en: He is replete with all the adornments,

source: །ཐོད་པའི་གདན་ལ་ཡང་དག་གནས།
en: And stands on a skull cup platform. “In his hands he is holding a skull cup

source: །བཤང་གཅི་ཁུ་བ་ཁྲག་རྣམས་ཀྱི།
en: Filled with excrement, urine, semen, and blood;

source: །ཐོད་པ་ཕྱག་གིས་བཟུང་བ་དང་། །གཞུ་དང་མདའ་ནི་འཛིན་པ་ཉིད།
en: A bow and arrow;

source: །དེ་བཞིན་རྡོ་རྗེ་དྲིལ་བུ་ཉིད།
en: A vajra scepter; and a bell.

source: །དང་པོ་རྡོ་རྗེ་འབར་བ་ཉིད།
en: “The first right hand has a blazing vajra scepter,

source: །གསུམ་པར་དེ་བཞིན་རྩེ་གསུམ་པ།
en: And the third, a trident.

source: །དཔལ་ལྡན་ཤེས་རབ་འཁྱུད་པ་དང་། །རལ་པའི་ཅོད་པན་བརྒྱན་པ་སྟེ།
en: The glorious one is embraced by his consort And adorned by a knot of matted hair.

source: །སྤྲིན་གྱི་འོད་འབར་དུ་མ་ནི།
en: “He should repeatedly radiate blazing light

source: །སངས་རྒྱས་དམ་ཚིག་སྤྲོ་བར་བྱ།
en: With scintillating clouds composed of buddhas. The practitioner should then visualize

source: །བྷ་གའི་དབུས་སུ་སྒྲུབ་པ་པོས།
en: Himself in the center of a bhaga.

source: །དེར་ནི་བདག་ཉིད་བསྒོམ་པར་བྱ།
en: “Then he should visualize the consort

source: །ལྷ་མོ་ལྷན་ཅིག་ལྡན་པར་ནི།
en: As united with the main deity.

source: །དེ་ནས་ཕྱག་རྒྱ་བསྒོམ་པར་བྱ།
en: On the lotus petals, he should draw the goddesses

source: །ཐོད་པའི་སྟན་ལ་གནས་པར་ནི། །འདབ་མར་ལྷ་མོ་བྲི་བར་བྱ།
en: Standing on skull cup platforms.

source: །སྣ་ཚོགས་གཟུགས་མ་ཡིད་འོང་མ།
en: “Their forms, of different colors, are pleasing to the mind

source: །ཞལ་གཅིག་མ་ལ་ཕྱག་བཞི་མ།
en: And they each have one face and four arms.

source: །དང་པོར་རིག་མ་བྲི་བར་བྱ།
en: First, he should draw the beautiful consort

source: །གཞུ་དང་མདའ་ནི་འཛིན་མ་མཛེས།
en: Who holds an arrow and bow,

source: །ཐོད་པ་ཁུ་བས་གང་བ་དང་། །ལྕགས་ཀྱུ་ལག་པས་འཛིན་པ་མོའོ།
en: “A skull cup filled with semen,

source: །གཉིས་པ་རྩེ་གསུམ་ལག་པ་དང་། །ཁྲག་གིས་གང་བའི་ཐོད་པ་དང་། །རྡོ་རྗེ་དེ་བཞིན་ཞགས་པ་ཉིད།
en: And a goad. Second, he should draw the goddess who has in her hands a spear, A skull cup filled with blood, “A vajra scepter, and a noose. He should draw her on the southern petal.

source: །གསུམ་པ་ལག་པར་རལ་གྲི་དང་། །ཐོད་པ་ཆུ་ཡིས་གང་བ་དང་། །དེ་བཞིན་རྡོ་རྗེ་དྲིལ་བུ་ཉིད།
en: Third, on the northern petal, he should draw The goddess who has in her hands a sword, “A skull cup filled with water, A vajra scepter, and a bell.

source: །བཞི་པ་ཁ་ཊྭཱཾ་ག་ལག་མ།
en: He should draw the fourth goddess On the western petal. “In her left hands she is holding A khaṭvāṅga and a skull cup,

source: །གཡོན་པའི་ལག་པས་ཐོད་པ་ཉིད།
en: And in her right hands

source: །མུ་སུཎྜཱི་དང་བ་དན་གསུམ།
en: A ‘flame thrower’ and a triple banner.

source: །ལྔ་པ་ཞགས་པའི་ལག་པ་དང་། །ཐོད་པ་ལག་པས་བཟུང་བ་དང་། །དེ་བཞིན་ཨུཏྤལ་ཅང་ཏེའུ་ཉིད།
en: “The fifth goddess has a staff in her hand And holds a skull cup with another. She also holds a lotus and a ḍamaru. He should draw her in the northeastern quarter. “In the northwestern corner he should draw

source: །དྲུག་པའི་ལག་པས་པདྨ་དང་། །ཐོད་པ་ཚིལ་གྱིས་གང་བ་དང་། །དེ་བཞིན་མེ་ལོང་དགྲ་སྟ་ཉིད།
en: The sixth goddess with a lotus in her hand. She also holds a skull cup filled with fat, A mirror, and an axe.

source: །བདུན་པ་འཕང་མདུང་ལག་པ་དང་། །དུང་དང་འཁོར་ལོའི་མཚོན་ཆ་འཛིན།
en: “The seventh goddess has a lance in her hand. She also holds a conch shell, a discus weapon,

source: །ཐོད་པ་ཁྲག་གིས་གང་བར་ནི།
en: And a skull cup filled with blood.

source: །ཁྲུ་གང་ཙམ་དུ་ཡང་དག་བྲི།
en: He should draw her in the southwestern quarter.

source: །བརྒྱད་པ་བུམ་པའི་ལག་པ་དང་། །དེ་བཞིན་རྡོ་རྗེ་དྲིལ་བུ་ཉིད།
en: “The eighth goddess he should draw

source: །ཐོད་པ་སྐྱེས་པའི་པགས་པ་ཡིས།
en: In the southeastern quarter. She is holding in her hands A pitcher, a vajra scepter, a bell,

source: །བཀབ་པ་རྫས་ཀྱིས་གང་བ་ནི།
en: “And a skull cup filled with substances, Covered with human skin.

source: །ཟེ་འབྲུར་བདེ་བ་ཆེན་པོ་དང་། །འདབ་མར་ལྷ་མོ་བྲི་བར་བྱ།
en: He should draw these goddesses on the petals And the lord Mahāsukha on the pericarp. “He should draw, in the secret maṇḍala,

source: །རོལ་མོ་རྣམ་པ་སྣ་ཚོགས་རྣམས།
en: Various musical instruments.

source: །གསང་བའི་དཀྱིལ་འཁོར་བྲི་བར་བྱ།
en: He should draw the gate keepers—

source: །ལྷ་མོ་རྡོ་རྗེ་ལྕགས་ཀྱུ་དང་། །རྡོ་རྗེ་ཞགས་པ་ལྕགས་སྒྲོག་དང་། །དེ་བཞིན་རྡོ་རྗེ་དྲིལ་བུ་ཉིད།
en: A goddess holding a goad, “And likewise, one with a vajra noose, a chain,

source: །སྒོ་ཡི་སྐྱོང་བ་ཡང་དག་ཁྲི།
en: And a vajra bell.

source: །བྷ་གའི་དབུས་སུ་བསྒོམ་བྱ་ཞིང་།
en: He should visualize himself in the center of a vulva,

source: །ཕྱིས་ནི་བཟླས་པ་ཡང་དག་བརྩམས།
en: And later begin mantra recitation.

source: །ཧཱུྃ་ནི་རྡོ་རྗེ་སེམས་དཔའ་ཡི།
en: Hūṁ pertains to Vajrasattva;

source: །ཨོཾ་ནི་དབྱངས་ཀྱི་དབྱེ་བ་ཉིད།
en: Oṁ is distinctiveness of tone;

source: །ཨཱ་ནི་ངག་དང་ཡང་དག་ལྡན། །ཤེལ་ནི་དག་པ་ལྟ་བུ་ཉིད།
en: Aḥ , which is of the color of pure crystal, Is perfectly endowed with speech.

source: །ཧྲཱིཿནི་དེ་ལ་ཡང་དག་སྦྱར།
en: “He should add the syllable hrīḥ

source: །དེ་བཞིན་དུ་ཡང་སྭཱ་ཧཱ་ཉིད།
en: And also the word svāhā

source: །སྔགས་ཀྱིས་བཟླས་པར་ཡང་དག་གསུངས།
en: This mantra has been taught as the one to recite,

source: །བསམ་གཏན་ཡི་གེ་གཅིག་པོ་ཉིད།
en: But, during meditation, it should consist of a single syllable.

source: །ལྷ་མོ་རྣམས་ཀྱི་ཧྲཱིཿཉིད་ནི།
en: “The syllable hrīḥ of the goddesses

source: །འདབ་མ་རྣམས་ལ་དེ་ནས་དགོད།
en: Should then be placed on the petals.

source: །མཆོད་པ་བཞི་ཡི་རང་བཞིན་གྱིས།
en: It should be joined with the four seed syllables

source: །ས་བོན་བཞི་དང་ཡང་དག་ལྡན། །སྒོ་ཡི་སྐྱོང་བ་ཐམས་ཅད་དུ།
en: That are the nature of the four types of offerings.

source: །དང་པོ་དབྱངས་ཡིག་ལ་སོགས་ལྡན།
en: “It should be joined with the first sound , and so forth, And placed on the female gatekeepers all around.

source: །བྷ་ག་ཉིད་དུ་སྒྲུབ་པ་པོས། །དེ་ནས་རྡོ་རྗེ་གཞུག་པར་བྱ། །ཧྲཱིཿཡི་རྣམ་པ་ཉིད་དང་ཡང་།
en: Then the practitioner should insert His vajra into the bhaga.

source: །དེ་ལ་ཧཱུྃ་ནི་བརྗོད་པར་བྱ།
en: “He should, at that point, utter the syllable hūṁ , And also the syllable hrīḥ . He should orally ingest the semen,

source: །ཟླ་མཚན་དུས་སུ་ཁྲག་བཅས་པའི།
en: Mixing it with the blood, when the woman is menstruating.

source: །ཁུ་བ་ཁ་ཡིས་བཟའ་བར་བྱ།
en: “He should make offerings of flowers and fragrances

source: །བདག་ཉིད་དང་ནི་བྷ་ག་ལ།
en: To himself and also to the bhaga.

source: །མེ་ཏོག་དྲི་ཡིས་མཆོད་པར་བྱ།
en: At this point he should recite the mantra

source: །གལ་ཏེ་སྒྲུབ་པོ་གྲུབ་འདོད་ན། །དེ་ཉིད་ལ་ནི་བཟླས་པར་བྱ།
en: If he wants to attain siddhi. “There is Vajraraudrī

source: །རྡོ་རྗེ་དྲག་མོ་དེ་བཞིན་གཅིག །དེ་བཞིན་རྡོ་རྗེ་གཟུགས་བརྙན་གཉིས།
en: And also Vajrabimbā.

source: །གསུམ་པ་རྡོ་རྗེ་འདོད་ཆགས་མ།
en: Vajrarāgī is the third

source: །བཞི་པ་རྡོ་རྗེ་ཞི་བ་མ།
en: And Vajrasaumyā the fourth.

source: །ལྔ་པ་རྡོ་རྗེ་གནོད་སྦྱིན་མ།
en: “The fifth is Vajrayakṣī

source: །དྲུག་པ་རྡོ་རྗེ་མཁའ་འགྲོ་མ།
en: And the sixth Vajraḍākinī.

source: །བདུན་པ་སྒྲ་ཡི་རྡོ་རྗེ་མ།
en: The seventh is Śabdavajrā

source: །དེ་བཞིན་བརྒྱད་པ་རྡོ་རྗེ་ས།
en: And Pṛthvīvajrā is the eighth.”

source: །གཉིས་པ་ལས་རབ་ཏུ་བྱེད་པ་གསུམ་པའོ།།
en: Here concludes the third part of the second chapter.

source: །།འཁོར་ལོ་སྒྲུབ་པའི་ཁྱད་པར་གྱི།
en: “Listen well, Vajragarbha, about the preparation

source: །རིམ་པ་ཇི་བཞིན་རྡོ་རྗེ་ཉོན།
en: Of magical circles and their specifications, as required for

source: །ཞི་དང་རྒྱས་དང་དབང་དང་ནི།
en: Pacifying, enriching, enthralling, and so forth,

source: །སྲུང་དང་དེ་བཞིན་མངོན་སྤྱོད་ཉིད།
en: And also protecting and assaulting. “The wise practitioner should have someone

source: །རེའུ་མིག་དགུ་སོགས་འཁོར་ལོ་ཡི། །ཕྱི་རོལ་མུ་ཁྱུད་ཉིད་དུ་བྱ།
en: Draw the outline of a wheel, with nine divisions and the rest,

source: །འཁོར་ལོ་ལས་ཀྱི་ཁ་དོག་སོགས།
en: And visualize the colors, and so forth,

source: །མཁས་པས་རྣམ་པར་བསྒོམ་པར་བྱ།
en: As required for individual rituals involving the circle.

source: །ཨོྃ་ཏཱ་རེ་ཏུཏྟཱ་རེ་ཏུ་རེ་སྭཱ་ཧཱ།
en: Oṁ tāre tuttāre ture svāhā

source: །འདི་ཡིས་ས་བོན་ཐམས་ཅད་ཀྱིས།
en: “The seed syllables of this mantra are all-purpose—

source: །ཕྱག་འཚལ་སྲེག་བླུགས་ཐ་མ་ནི།
en: The first and the last are for homage and homa respectively.

source: །དབུས་སུ་མིང་ནི་སྦྱར་བར་བྱ།
en: The target’s name should be included in the middle,

source: །སྲུང་བའི་ཚིག་ཀྱང་རྣམ་པར་བྱ།
en: Along with the phrase “please protect.” “He should fashion his form

source: །མཉམ་ཉིད་ཡེ་ཤེས་སྟོང་པས་ནི།
en: From emptiness, by means of the wisdom of equality,

source: །བདག་ཉིད་ཀྱི་ནི་གཟུགས་སུ་བྱ།
en: And position it within the protective circle,

source: །མཉམ་ཉིད་ཀུན་རིག་གནས་སུ་ནི།
en: The place of knowing everything as equal.

source: །སྲུང་བའི་འཁོར་ལོ་སྦྱར་བྱ་བ།
en: “He should meditate that protection is provided

source: །སྲུང་བ་ཡེ་ཤེས་ཅན་གྱིས་བསྒོམ། །འཇིགས་པ་ཐམས་ཅད་རིང་དུ་བྱེད།
en: By wisdom beings, so that all dangers are kept at a distance.

source: །སེམས་ཅན་དངོས་པོ་མེད་ན་ནི།
en: Accepting the non-reality of sentient beings,

source: །རྣལ་འབྱོར་དངོས་པོ་བསྒོམ་པར་བྱ།
en: He should cultivate the state of deity yoga.

source: །ཟླ་བའི་དཀྱིལ་འཁོར་དབུས་གནས་པར།
en: “In the center of a moon disk

source: །པདྨའི་གདན་ནི་བསམ་པར་བྱ། །དངོས་གྲུབ་ཐམས་ཅད་རབ་སྟེར་མར།
en: He should visualize a lotus throne

source: །བདག་གི་ལུས་ནི་བསྒོམ་པར་བྱ།
en: And imagine there his own body

source: །ཨོྃ་ཏཱ་རེ་སྭཱ་ཧཱ།
en: As the goddess Tārā, who grants all siddhis. “He should visualize the following letters:

source: །མགོ་བོ་ལའོ།
en: “On his head, oṁ tāre svāhā

source: །ཨོྃ་ཏཱ་རེ་སྭཱ་ཧཱ། མིག་དག་ལའོ།
en: On the eyes, oṁ tuttāre svāhā

source: །ཨོྃ་ཏཱ་རེ་སྭཱ་ཧཱ། སྣ་དག་ལའོ།
en: On the nose, oṁ ture svāhā

source: །ཨོྃ་ཏུ་སྭཱ་ཧཱ། རྣ་བ་དག་ལའོ།
en: On the ears, oṁ tu svāhā

source: །ཨོྃ་རེ་སྭཱ་ཧཱ། ལྕེ་ལའོ།
en: On the tongue, oṁ re svāhā

source: །ཨོྃ་ཏཱ་རི་ནི་སྭཱ་ཧཱ། སྙིང་གར་རོ།
en: On the chest, oṁ tāriṇi svāhā

source: །ཡན་ལག་དྲུག་ནི་རྣམ་པར་གཟུང་།
en: “He should always wear this sixfold protection

source: །འཕགས་མ་སྒྲོལ་མ་བསམ་པར་བྱ།
en: And visualize himself as noble Tārā,

source: །ཕྱག་གཉིས་སེམས་དཔའི་སྐྱིལ་མོ་ཀྲུང་།
en: With two arms, sitting in the sattvaparyaṅka posture,

source: །ཀུན་ལ་སྐྱབས་སྦྱིན་ལག་པ་དང་། །གཡོན་པ་ཨུཏྤལ་ལྟ་བུ་མཆོག །སྔགས་ཀྱི་རྒྱལ་པོས་བསྐུལ་བ་ཡིས།
en: Her left one holds a lotus.

source: །ལྷ་རྣམས་ཐམས་ཅད་བསྒྲུབ་པར་བྱ།
en: Among all the deities, he should propitiate The one who is roused by the following king of mantras:

source: །ཨོཾ་ཀུ་རུ་ཀུལླེ་ཧྲཱིཿསྭཱ་ཧཱ།
en: Oṁ kurukulle hrīḥ svāhā

source: །ལས་ཐམས་ཅད་པའི་སྔགས་སོ།
en: “This mantra accomplishes everything.

source: །དགྲ་དང་རྒྱལ་པོས་བཅིངས་པ་དང་། །འགྲོ་བའི་ཤིན་ཏུ་འཇིགས་པའི་དུག །ཡན་ལག་རིམས་ནི་སྣ་ཚོགས་དང་། །དུག་སོགས་དུས་མིན་འཆི་བ་ཡི།
en: “It protects from being bound by enemies and kings, From poisons dreadful in their ways. It arrests various fevers afflicting the body And removes untimely death due to toxins and so forth.

source: །འཇིགས་པའི་གནས་ནི་གང་གང་ལ།
en: “Wherever there is fear,

source: །དེ་དང་དེ་ལ་རབ་སྦྱར་བྱ།
en: He should employ this mantra.

source: །ཤེས་རབ་ཆུབ་པ་བློ་ལྡན་པར།
en: A dull-witted person will become intelligent.

source: །སྲུང་བ་བྲིས་ནས་གཟུང་བར་བྱ།
en: He should write it down and wear it for protection.

source: །སྲུང་བ་བཟང་པོ་འདི་ཉིད་ནི།
en: “This sublime protection

source: །འཇིགས་པ་ཐམས་ཅད་དུ་ནི་སྤངས།
en: Vanquishes every threat.

source: །སྲུང་བ་འདི་ནི་ཐམས་ཅད་ལས།
en: It protects everyone;

source: །རྣལ་འབྱོར་དེ་ཉིད་གོང་ན་མེད།
en: It is the unsurpassable essence of deity yoga. “He should visualize a sun disk

source: །འབར་བའི་འོད་ཟེར་ལྟ་བུ་ཡི། །ཉི་མའི་དཀྱིལ་འཁོར་བསམས་ནས་ནི།
en: With blazing light rays,

source: །དེ་ཡི་དབུས་སུ་ཧྲཱིཿཉིད་ནི།
en: And at its center the syllable hrīḥ

source: །ཁ་དོག་དམར་པོ་ལྟ་བུའི་འོད།
en: Shining with red light.

source: །དེ་ནས་བདག་ཉིད་བསྒོམ་པར་བྱ།
en: “Then, he should visualize himself

source: །མདའ་དང་གཞུ་ཡི་ལག་པ་མ།
en: Holding in one pair of her hands an arrow and a bow,

source: །ཨུཏྤ་ལ་དང་ལྕགས་ཀྱུ་འཛིན།
en: And in the other pair, a lotus and a goad.

source: །འདི་ནི་བསྒོམས་པ་ཙམ་གྱིས་ནི།
en: “By merely meditating on this

source: །འཇིག་རྟེན་གསུམ་པོ་དབང་དུ་བྱེད།
en: One can enthrall the threefold universe—

source: །འབུམ་ཕྲག་གཅིག་གིས་རྒྱལ་པོ་རྣམས།
en: Kings with one hundred thousand repetitions of the mantra;

source: །ཁྲི་ཡིས་འཇིག་རྟེན་ཕལ་པ་ཉིད།
en: Ordinary people with ten thousand;

source: །བྱེ་བས་ཕྱུགས་དང་གནོད་སྦྱིན་སོགས།
en: “Animals, yakṣas, and so forth with ten million repetitions;

source: །འབུམ་ཕྲག་བདུན་གྱིས་ལྷ་མ་ཡིན།
en: Demigods with seven hundred thousand;

source: །འབུམ་ཕྲག་གཉིས་ཀྱིས་ལྷ་རྣམས་ཉིད།
en: Gods with two hundred thousand;

source: །བརྒྱ་ཕྲག་གཅིག་གིས་སྔགས་པ་ཉིད།
en: And followers of Mantra with one hundred.

source: །འཁོར་ལོ་འདབ་མ་བརྒྱད་པ་འདི།
en: “This yantra-wheel has eight spokes,

source: །ཁ་དོག་དཀར་པོ་ཤིན་ཏུ་མཛེས།
en: Is white, and has a beautiful glow.

source: །མཉམ་ཉིད་གཟུགས་སུ་བསམས་ནས་ནི།
en: Visualizing it as having the nature of equality,

source: །ཁམས་གསུམ་གྱི་ནི་རང་བཞིན་གྱིས།
en: And being in essence the threefold universe,

source: །སྔར་གསུངས་མཚན་ཉིད་ཡང་དག་ལྡན།
en: “He should form himself as previously explained

source: །གོང་དུ་གསུངས་པས་བསྒྲུབ་པར་བྱ།
en: With the aforementioned characteristics, And then visualize yantra-wheel

source: །ཤེས་རབ་འབར་བའི་ལས་རྣམས་ནི། །འདི་ཡི་འཁོར་ལོ་བསྒོམ་པར་བྱ།
en: In the rituals for making wisdom blaze forth.

source: །ཨོྃ་པྲཛྙེ་མ་ཧཱ་པྲཛྙེ་ཧཱུྃ་སྭཱ་ཧཱ།
en: “He should recite, Oṁ prajñe mahāprajñe hūṁ svāhā

source: །དངོས་པོའི་ངོ་བོས་བསྒོམ་པར་བྱ།
en: “He should visualize himself by means of merging with the essence

source: །འོད་ཟེར་འབར་བ་དུ་མ་ཡི།
en: As Prajñāpāramitā, the very nature of wisdom made manifest,

source: །ཤེས་རབ་བདག་ཉིད་རྣམ་པར་སྤྲུལ།
en: And blazing with a profusion of light.

source: །ཁ་དོག་དཀར་པོ་འོད་གསལ་མ།
en: Sublime with white radiance,

source: །ཤེས་རབ་བདག་ཉིད་གཟུང་བར་བྱ།
en: She should be construed as the very nature of wisdom.

source: །འདི་ཡི་ས་བོན་བཟླས་ནས་ནི། །ཤེས་རབ་འདབ་མ་ལྟ་བུར་འཕེལ།
en: “When this mantra is recited

source: །གུ་བའམ་བློ་ནི་དམན་པ་ཡི།
en: By those who are dull, or of inferior intellect,

source: །ཤེས་རབ་འཕེལ་བའི་རྣལ་འབྱོར་རོ།
en: Their wisdom will grow like the branch of a tree Through their applying this method for increasing it.

source: །ཡི་གེ་དེ་ལ་དགོད་པར་བྱ།
en: He should place the seed syllable of Vairocana. This syllable changes into the lord with one face and four arms,

source: །ཐོད་པའི་གདན་གྱི་དབུས་གནས་པར། །ཞལ་གཅིག་པ་ལ་ཕྱག་བཞི་པ།
en: Sitting in the center of a throne of human skulls.

source: །ཞི་བའི་འཁོར་ལོ་དྲིལ་བུ་འཛིན།
en: “Of gentle disposition, he holds a wheel, a bell,

source: །ཐོད་པ་དང་ནི་ཞགས་པ་ཉིད།
en: A human skull, and a noose. He radiates bursts of light all around

source: །དེ་བཞིན་འབར་བའི་ཕྲེང་འཁྲུགས་པར། །ཀུན་ཏུ་རྣམ་པར་སྤྲོ་བར་བྱ།
en: And is surrounded by a halo of flames.

source: །འདིར་ནི་རྣལ་འབྱོར་རིམ་པས་ནི།
en: “Following the same procedure,

source: །རིན་ཆེན་འབྱུང་གནས་བསྒོམ་པར་བྱ།
en: He should visualize Ratnasambhava—

source: །བཙོ་མ་གསེར་གྱི་མདོག་ལྟ་བུ།
en: Radiant yellow,

source: །སྐུ་མདོག་སེར་པོ་གཟི་བརྗིད་ཆེ།
en: Resembling molten gold,

source: །ཐོད་པའི་གདན་གྱི་དབུས་བཞུགས་པ།
en: “Sitting in the center of a throne of human skulls,

source: །ཞལ་གཅིག་པ་ལ་ཕྱག་བཞི་པ།
en: With one face and four arms,

source: །དཔའ་བོ་རིན་ཆེན་ལྕགས་ཀྱུ་འཛིན།
en: Of heroic disposition, and holding a jewel, a goad,

source: །ཐོད་པ་དེ་བཞིན་ཞགས་པ་ཉིད།
en: A human skull, and a noose.

source: །པདྨ་རྡོ་རྗེ་འཆང་བ་བསྒོམ།
en: The vajra holder of the lotus family

source: །པདྨ་རཱ་ག་ལྟ་བུའི་འོད།
en: Shining like ruby,

source: །དཔའ་བོ་མདའ་དང་གཞུ་འཛིན་ཅིང་།
en: “Holding a bow and arrow, of heroic disposition,

source: །ཐོད་པའི་གདན་ལ་ཡང་དག་བཞུགས།
en: Sitting on a throne of human skulls.

source: །པདྨ་ཞགས་པ་འཛིན་པ་ཉིད།
en: Holding in his other pair of hands a lotus and a noose,

source: །འདིས་ནི་རིམ་པའི་རྣལ་འབྱོར་གྱིས།
en: “Following the same procedure, he should visualize

source: །དོན་ཡོད་ཕྱག་ན་རལ་གྲི་འཛིན།
en: Amoghasiddhi, a sword in his hand,

source: །ཐོད་པའི་གདན་གྱི་དབུས་བཞུགས་པར།
en: Sitting in the center of a throne of human skulls,

source: །ཐོད་པ་རྡོ་རྗེ་དྲིལ་བུ་དང་། །ལྕགས་ཀྱུ་དག་ནི་གཡས་པས་འཕྱར།
en: “Holding a human skull and a vajra bell, And brandishing a goad in one of his right hands.

source: །བཻ་ཌཱུརྱ་ལྟར་ལྗང་གུ་སྟེ།
en: He is the color of green beryl

source: །ནམ་མཁའི་ཁམས་ཀྱི་དབུས་སོན་པ།
en: “In the middle of the expanse of the sky,

source: །ཟླ་བའི་དཀྱིལ་འཁོར་བསམ་པར་བྱ།
en: He should visualize a moon disk.

source: །དེ་ཡི་ནང་སོན་ས་བོན་ནི།
en: At its center, is the seed syllable bhrūṁ

source: །བྲུྃ་ལས་སྤྱན་གྱི་དབྱིབས་སུ་ནི།
en: Which changes into the form of Locanā.

source: །ཐོད་པའི་གདན་གྱི་དབུས་གནས་པར།
en: “Sitting on a throne of human skulls,

source: །ཕྱག་ནི་བརྒྱད་ཀྱིས་རྣམ་པར་བརྒྱན།
en: She is adorned with eight arms

source: །འཁོར་ལོའི་ལག་པ་མདའ་དང་གཞུ།
en: And holds in her hands a wheel,

source: །དེ་བཞིན་རྡོ་རྗེ་དྲིལ་བུ་ཉིད། །ཞགས་པ་རལ་གྲི་ཐོད་པ་ཉིད།
en: A bow and arrow, a vajra scepter, a bell, “A noose, a sword, and a human skull.

source: །སྤྱན་གསུམ་པ་ལ་ཞལ་གཅིག་མ།
en: She has one face and three eyes,

source: །དོ་ཤལ་དང་ནི་རྐང་གདུབ་བརྒྱན།
en: Necklaces, and anklets.

source: །ཁ་དོག་དཀར་མོ་ཤིན་ཏུ་མཛེས།
en: “She is white and very beautiful,

source: །དེ་བཞིན་ཐོད་པའི་དབུ་རྒྱན་ཉིད།
en: And she is wearing a crown of human skulls. Next he should visualize, in the middle

source: །ནམ་མཁའི་ཁམས་ཀྱི་དབུས་སོན་པ། །ཟླ་བའི་དཀྱིལ་འཁོར་ཡོངས་གང་བ།
en: Of the expanse of the sky, a full moon disk.

source: །དེ་ཡི་ནང་སོན་བསམ་པར་བྱ།
en: “At its center there is the syllable hūṁ

source: །ཧཱུྃ་ལས་མཱ་མ་ཀཱི་ཡི་དབྱིབས།
en: Which changes into the form of Māmakī,

source: །ཐོད་པའི་གདན་གྱི་དབུས་གནས་པར། །ཁ་དོག་སྔོན་མོ་འབར་ཆེན་མོ།
en: Radiant blue in color, Sitting in the center of a throne of human skulls.

source: །སྤྱན་གསུམ་མ་ལ་ཞལ་གཅིག་མ།
en: “She has three eyes, one face,

source: །ཐོད་པའི་ཕྲེང་བས་རྣམ་པར་བརྒྱན།
en: And is adorned with a garland of human skulls.

source: །མདའ་དང་གཞུ་ནི་འཛིན་པ་ཉིད།
en: She holds a bow, an arrow,

source: །ལྕགས་ཀྱུ་དང་ནི་རལ་གྲི་ཉིད།
en: A goad, a sword,

source: །ཞགས་པ་རྡོ་རྗེ་དེ་བཞིན་དུ།
en: “A noose, a scepter,

source: །དྲིལ་བུ་དང་ནི་ཐོད་པའོ།
en: A bell, a human skull,

source: །འཁོར་ལོ་རིན་ཆེན་པདྨ་དང་། །ཁ་ཊྭཱཾ་ག་དང་བཅུ་གཉིས་ནི།
en: A wheel, a jewel, a lotus, and a khaṭvāṅga— Twelve articles for her twelve hands.

source: །བྷ་གའི་དབུས་སུ་ཡོངས་གང་བའི།
en: In the center of the bhaga,

source: །ཟླ་བའི་དཀྱིལ་འཁོར་བསྒོམ་པར་བྱ།
en: He should visualize a full moon disk.

source: །དེར་ནི་ཧྲཱིཿནི་བསམ་བྱ་ཞིང་།
en: “There he should visualize the syllable hrīḥ

source: །གོས་དཀར་ཞེས་བྱ་རྣམ་པར་བསྒོམ།
en: And generate from it the goddess called Pāṇḍarā.

source: །ཁ་དོག་དམར་མོ་འབར་ཆེན་མོ།
en: And blazes forth bright red light.

source: །རྒྱན་རྣམས་ཀུན་གྱིས་ཡོངས་གང་བ།
en: “Replete with all adornments,

source: །ཕྱག་བརྒྱད་ཀྱིས་ནི་རྣམ་པར་བརྒྱན།
en: She is adorned with eight hands, In which she is holding a bow,

source: །གཞུ་དང་མདའ་ནི་འཛིན་པ་དང་། །པདྨའི་ལག་པར་རལ་གྲི་དང་། །ཐོད་པ་རྡོ་རྗེ་དྲིལ་བུ་དང་། །ཞགས་པ་དེ་བཞིན་རིན་ཆེན་ཉིད།
en: An arrow, a lotus, a sword, “A skull cup, a vajra scepter, a bell,

source: །དོ་ཤལ་དང་ནི་རྐང་གདུབ་སྒྲ།
en: A noose, and a jewel.

source: །རྣལ་འབྱོར་པས་ནི་འདི་བསྒོམས་ན།
en: “If the practitioner visualizes her as such,

source: །མྱུར་དུ་སངས་རྒྱས་ཐོབ་པར་འགྱུར།
en: He will swiftly attain the state of awakening.

source: །ནམ་མཁའི་དབུས་སུ་ཡོངས་གང་བའི།
en: Next he should visualize, in the sky above,

source: །དེ་ཡི་ནང་སོང་ཏཱྃ་ཉིད་ནི།
en: “At its center there is the syllable tāṁ

source: །སྒྲོལ་མའི་དབྱིབས་སུ་བསམ་པར་བྱ། །ཐོད་པའི་གདན་གྱི་དབུས་གནས་པར།
en: Which changes into the form of Tārā,

source: །རལ་གྲི་ཕྱག་ན་ཆགས་བཅས་མ།
en: “Impassioned, she holds in her hands a sword,

source: །ཨུཏྤལ་དེ་བཞིན་ལྕགས་ཀྱུ་དང་། །ཐོད་པ་ཁྲག་གིས་གང་བ་དང་། །ཞགས་པ་དེ་བཞིན་འཁོར་ལོ་དང་། །གཞུ་དང་མདའ་ནི་འཛིན་པ་ཉིད།
en: A lotus, a goad, A skull cup filled with blood, A noose, a wheel, “A bow, and an arrow.

source: །ཞལ་གཅིག་མ་ནི་ཡང་དག་བྲི།
en: He should visualize her with one face,

source: །ཁ་དོག་ལྗང་གུ་སྤྱན་གསུམ་མ།
en: Of green color, with three eyes,

source: །དེ་ལྟར་རྣལ་འབྱོར་པས་བསྒོམས་པས།
en: “If the practitioner meditates in this way,

source: །རྡོ་རྗེ་སེམས་དཔའ་མཉམ་པར་འགྱུར།
en: He will become equal to Vajrasattva.”

source: །རྒྱུད་ཐམས་ཅད་ཀྱི་གླེང་གཞིའི་གསང་བ་དཔལ་ཡང་དག་པར་སྦྱོར་བ་ལས་བྱུང་བ་ལས་བརྟག་པའི་རྒྱལ་པོ་གཉིས་པའོ།།
en: This concludes the sovereign second chapter of the glorious “ Emergence from Sampuṭa ,” so called to reflect the secret foundation of all tantras.

source: །།ཧེ་རུ་ཀ་དང་བདག་མེད་མའི།
en: Chapter 3 “Listen about the practice, as it really is,

source: །སྐྱེད་པའི་སྒྲུབ་དང་དེ་ཉིད་ཉོན།
en: Of generating Nairātmyā and Heruka,

source: །གང་གིས་གདུག་པ་དྲག་པོ་ཡིས།
en: One through which all wicked

source: །སེམས་ཅན་འདུལ་བར་འགྱུར་བ་ཡི།
en: And violent beings will be tamed.

source: །མཁའ་འགྲོ་མཁའ་འགྲོ་མས་མཛད་པའི།
en: “The transformations effected by the ḍāka and ḍākinīs—

source: །དེ་དག་ཐམས་ཅད་ཁྱོད་ལ་བཤད།
en: All of them I will explain to you.

source: །རྡོ་རྗེ་སེམས་དཔར་གྱུར་ནས་ཀྱང་།
en: The vajra-holding Heruka, in his identity of Vajrasattva,

source: །རྡོ་རྗེ་ཅན་ཉིད་རྡོ་རྗེར་དབབ།
en: Will bring on the vajra-like state.

source: །འབར་བའི་ཕྲེང་འཁྲུགས་དྲག་པོ་ནི།
en: “One should assume a wild form in a raging ring of flames;

source: །ཀུན་ཏུ་རྣམ་པར་སྤྲོ་བར་བྱ།
en: It should be radiating all around. One should next visualize a garland of seed syllables

source: །ཟླ་བའི་དཀྱིལ་འཁོར་དབུས་གནས་པར། །ས་བོན་ཕྲེང་བ་དེ་ནས་དགོད།
en: In the center of a moon disk.

source: །དེ་ནས་རྡོ་རྗེ་ཆགས་ཆེན་ལས།
en: “Then the vajra-holding Heruka, out of great passion,

source: །རིག་མར་བཅས་པ་ཁུ་བར་གྱུར།
en: Melts down along with his consort . Subsequently, the vidyās of the retinue exhort him,

source: །སྣ་ཚོགས་གླུ་ཡི་མཆོད་པ་ལས། །དེ་ནས་རིག་མས་བསྐུལ་བར་བྱ།
en: By offering various songs, to rise again. {3.1.4} “Pukkasī: “ ‘Arise, O lord!

source: །རྗེ་བཙུན་སྙིང་རྗེའི་ཡིད་བཞེངས་ཤིག །པུཀྐ་སཱི་ནི་བདག་ལ་སྐྱོབས།
en: You are the essence of compassion! Please save me, Pukkasī.

source: །སྟོང་པའི་རང་བཞིན་ཉིད་སྤོངས་ལ།
en: Abandon your void nature!

source: །བདག་ལ་བདེ་ཆེན་སྦྱོར་བཞེད་མཛོད།
en: Take me in union, O Great Bliss!’ “Śavarī:

source: །ཁྱོད་མེད་ན་ནི་བདག་འགུམ་པས།
en: ‘Without you I would die.

source: །ཀྱེ་ཡི་རྡོ་རྗེ་ཁྱོད་བཞེངས་ཤིག །སྟོང་པའི་རང་བཞིན་ཉིད་སྤོངས་ལ།
en: Arise, Hevajra! Abandon the state of the empty nature!
